# ImportElements Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCHybridImport..::..ImportElements Method
IFCHybridImport Class See Also
---
Imports IFC Elements using non-open-source framework
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public IList<ElementId> ImportElements(
	Document doc,
	string file
)
```

Visual Basic
---
```text
Public Function ImportElements ( _
	doc As Document, _
	file As String _
) As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ ImportElements(
	Document^ doc,
	String^ file
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document Document to receive Elements from Import
file
    Type: System..::..String Full path of the file to import.
# ### Return Value
Returns an array of ElementIds representing created Elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace